Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_risab.h
/*
; stm32V873_risab.
; ================

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     stm32V873_risab equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// RISAB address definitions
// -------------------------

typedef struct {
    volatile    uint32_t    CR;
    volatile    uint32_t    RESERVED0;
    volatile    uint32_t    IASR;
    volatile    uint32_t    IACR;
    volatile    uint32_t    RCFGLOCKR;
    volatile    uint32_t    RESERVED1[3];
    volatile    uint32_t    IAESR;
    volatile    uint32_t    IADDR;
    volatile    uint32_t    RESERVED2[54];
    volatile    uint32_t    PG0_SECCFGR;
    volatile    uint32_t    PG1_SECCFGR;
    volatile    uint32_t    PG2_SECCFGR;
    volatile    uint32_t    PG3_SECCFGR;
    volatile    uint32_t    PG4_SECCFGR;
    volatile    uint32_t    PG5_SECCFGR;
    volatile    uint32_t    PG6_SECCFGR;
    volatile    uint32_t    PG7_SECCFGR;
    volatile    uint32_t    PG8_SECCFGR;
    volatile    uint32_t    PG9_SECCFGR;
    volatile    uint32_t    PG10_SECCFGR;
    volatile    uint32_t    PG11_SECCFGR;
    volatile    uint32_t    PG12_SECCFGR;
    volatile    uint32_t    PG13_SECCFGR;
    volatile    uint32_t    PG14_SECCFGR;
    volatile    uint32_t    PG15_SECCFGR;
    volatile    uint32_t    PG16_SECCFGR;
    volatile    uint32_t    PG17_SECCFGR;
    volatile    uint32_t    PG18_SECCFGR;
    volatile    uint32_t    PG19_SECCFGR;
    volatile    uint32_t    PG20_SECCFGR;
    volatile    uint32_t    PG21_SECCFGR;
    volatile    uint32_t    PG22_SECCFGR;
    volatile    uint32_t    PG23_SECCFGR;
    volatile    uint32_t    PG24_SECCFGR;
    volatile    uint32_t    PG25_SECCFGR;
    volatile    uint32_t    PG26_SECCFGR;
    volatile    uint32_t    PG27_SECCFGR;
    volatile    uint32_t    PG28_SECCFGR;
    volatile    uint32_t    PG29_SECCFGR;
    volatile    uint32_t    PG30_SECCFGR;
    volatile    uint32_t    PG31_SECCFGR;
    volatile    uint32_t    RESERVED3[32];
    volatile    uint32_t    PG0_PRIVCFGR;
    volatile    uint32_t    PG1_PRIVCFGR;
    volatile    uint32_t    PG2_PRIVCFGR;
    volatile    uint32_t    PG3_PRIVCFGR;
    volatile    uint32_t    PG4_PRIVCFGR;
    volatile    uint32_t    PG5_PRIVCFGR;
    volatile    uint32_t    PG6_PRIVCFGR;
    volatile    uint32_t    PG7_PRIVCFGR;
    volatile    uint32_t    PG8_PRIVCFGR;
    volatile    uint32_t    PG9_PRIVCFGR;
    volatile    uint32_t    PG10_PRIVCFGR;
    volatile    uint32_t    PG11_PRIVCFGR;
    volatile    uint32_t    PG12_PRIVCFGR;
    volatile    uint32_t    PG13_PRIVCFGR;
    volatile    uint32_t    PG14_PRIVCFGR;
    volatile    uint32_t    PG15_PRIVCFGR;
    volatile    uint32_t    PG16_PRIVCFGR;
    volatile    uint32_t    PG17_PRIVCFGR;
    volatile    uint32_t    PG18_PRIVCFGR;
    volatile    uint32_t    PG19_PRIVCFGR;
    volatile    uint32_t    PG20_PRIVCFGR;
    volatile    uint32_t    PG21_PRIVCFGR;
    volatile    uint32_t    PG22_PRIVCFGR;
    volatile    uint32_t    PG23_PRIVCFGR;
    volatile    uint32_t    PG24_PRIVCFGR;
    volatile    uint32_t    PG25_PRIVCFGR;
    volatile    uint32_t    PG26_PRIVCFGR;
    volatile    uint32_t    PG27_PRIVCFGR;
    volatile    uint32_t    PG28_PRIVCFGR;
    volatile    uint32_t    PG29_PRIVCFGR;
    volatile    uint32_t    PG30_PRIVCFGR;
    volatile    uint32_t    PG31_PRIVCFGR;
    volatile    uint32_t    RESERVED4[224];
    volatile    uint32_t    PG0_C2PRIVCFGR;
    volatile    uint32_t    PG1_C2PRIVCFGR;
    volatile    uint32_t    PG2_C2PRIVCFGR;
    volatile    uint32_t    PG3_C2PRIVCFGR;
    volatile    uint32_t    PG4_C2PRIVCFGR;
    volatile    uint32_t    PG5_C2PRIVCFGR;
    volatile    uint32_t    PG6_C2PRIVCFGR;
    volatile    uint32_t    PG7_C2PRIVCFGR;
    volatile    uint32_t    PG8_C2PRIVCFGR;
    volatile    uint32_t    PG9_C2PRIVCFGR;
    volatile    uint32_t    PG10_C2PRIVCFGR;
    volatile    uint32_t    PG11_C2PRIVCFGR;
    volatile    uint32_t    PG12_C2PRIVCFGR;
    volatile    uint32_t    PG13_C2PRIVCFGR;
    volatile    uint32_t    PG14_C2PRIVCFGR;
    volatile    uint32_t    PG15_C2PRIVCFGR;
    volatile    uint32_t    PG16_C2PRIVCFGR;
    volatile    uint32_t    PG17_C2PRIVCFGR;
    volatile    uint32_t    PG18_C2PRIVCFGR;
    volatile    uint32_t    PG19_C2PRIVCFGR;
    volatile    uint32_t    PG20_C2PRIVCFGR;
    volatile    uint32_t    PG21_C2PRIVCFGR;
    volatile    uint32_t    PG22_C2PRIVCFGR;
    volatile    uint32_t    PG23_C2PRIVCFGR;
    volatile    uint32_t    PG24_C2PRIVCFGR;
    volatile    uint32_t    PG25_C2PRIVCFGR;
    volatile    uint32_t    PG26_C2PRIVCFGR;
    volatile    uint32_t    PG27_C2PRIVCFGR;
    volatile    uint32_t    PG28_C2PRIVCFGR;
    volatile    uint32_t    PG29_C2PRIVCFGR;
    volatile    uint32_t    PG30_C2PRIVCFGR;
    volatile    uint32_t    PG31_C2PRIVCFGR;
    volatile    uint32_t    RESERVED5[114];
    volatile    uint32_t    RDCFGR;
    volatile    uint32_t    RESERVED6;
    volatile    uint32_t    WRCFGR;
    volatile    uint32_t    RESERVED7[107];
    volatile    uint32_t    PG0_CIDCFGR;
    volatile    uint32_t    PG1_CIDCFGR;
    volatile    uint32_t    PG2_CIDCFGR;
    volatile    uint32_t    PG3_CIDCFGR;
    volatile    uint32_t    PG4_CIDCFGR;
    volatile    uint32_t    PG5_CIDCFGR;
    volatile    uint32_t    PG6_CIDCFGR;
    volatile    uint32_t    PG7_CIDCFGR;
    volatile    uint32_t    PG8_CIDCFGR;
    volatile    uint32_t    PG9_CIDCFGR;
    volatile    uint32_t    PG10_CIDCFGR;
    volatile    uint32_t    PG11_CIDCFGR;
    volatile    uint32_t    PG12_CIDCFGR;
    volatile    uint32_t    PG13_CIDCFGR;
    volatile    uint32_t    PG14_CIDCFGR;
    volatile    uint32_t    PG15_CIDCFGR;
    volatile    uint32_t    PG16_CIDCFGR;
    volatile    uint32_t    PG17_CIDCFGR;
    volatile    uint32_t    PG18_CIDCFGR;
    volatile    uint32_t    PG19_CIDCFGR;
    volatile    uint32_t    PG20_CIDCFGR;
    volatile    uint32_t    PG21_CIDCFGR;
    volatile    uint32_t    PG22_CIDCFGR;
    volatile    uint32_t    PG23_CIDCFGR;
    volatile    uint32_t    PG24_CIDCFGR;
    volatile    uint32_t    PG25_CIDCFGR;
    volatile    uint32_t    PG26_CIDCFGR;
    volatile    uint32_t    PG27_CIDCFGR;
    volatile    uint32_t    PG28_CIDCFGR;
    volatile    uint32_t    PG29_CIDCFGR;
    volatile    uint32_t    PG30_CIDCFGR;
    volatile    uint32_t    PG31_CIDCFGR;
} RISAB_TypeDef;

#if (defined(__cplusplus))
#define RISAB_NS    reinterpret_cast<RISAB_TypeDef *>(0x48102000u)
#define RISAB_S     reinterpret_cast<RISAB_TypeDef *>(0x58102000u)

#else
#define RISAB_NS    ((RISAB_TypeDef *)0x48102000u)
#define RISAB_S     ((RISAB_TypeDef *)0x58102000u)
#endif

