Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_risab.h
// CR Configuration

#define RISAB_CR_SRWIAD                     (0x1u<<31)
#define RISAB_CR_GLOCK                      (0x1u<<0)

#define RISAB_CR_SRWIAD_B_0X0               (0x0u<<31)
#define RISAB_CR_SRWIAD_B_0X1               (0x1u<<31)
#define RISAB_CR_GLOCK_B_0X0                (0x0u<<0)
#define RISAB_CR_GLOCK_B_0X1                (0x1u<<0)

// IASR Configuration

#define RISAB_IASR_IAEF                     (0x1u<<1)
#define RISAB_IASR_CAEF                     (0x1u<<0)

// IACR Configuration

#define RISAB_IACR_IAEF                     (0x1u<<1)
#define RISAB_IACR_CAEF                     (0x1u<<0)

// RCFGLOCKR Configuration

#define RISAB_RCFGLOCKR_RLOCK31             (0x1u<<31)
#define RISAB_RCFGLOCKR_RLOCK30             (0x1u<<30)
#define RISAB_RCFGLOCKR_RLOCK29             (0x1u<<29)
#define RISAB_RCFGLOCKR_RLOCK28             (0x1u<<28)
#define RISAB_RCFGLOCKR_RLOCK27             (0x1u<<27)
#define RISAB_RCFGLOCKR_RLOCK26             (0x1u<<26)
#define RISAB_RCFGLOCKR_RLOCK25             (0x1u<<25)
#define RISAB_RCFGLOCKR_RLOCK24             (0x1u<<24)
#define RISAB_RCFGLOCKR_RLOCK23             (0x1u<<23)
#define RISAB_RCFGLOCKR_RLOCK22             (0x1u<<22)
#define RISAB_RCFGLOCKR_RLOCK21             (0x1u<<21)
#define RISAB_RCFGLOCKR_RLOCK20             (0x1u<<20)
#define RISAB_RCFGLOCKR_RLOCK19             (0x1u<<19)
#define RISAB_RCFGLOCKR_RLOCK18             (0x1u<<18)
#define RISAB_RCFGLOCKR_RLOCK17             (0x1u<<17)
#define RISAB_RCFGLOCKR_RLOCK16             (0x1u<<16)
#define RISAB_RCFGLOCKR_RLOCK15             (0x1u<<15)
#define RISAB_RCFGLOCKR_RLOCK14             (0x1u<<14)
#define RISAB_RCFGLOCKR_RLOCK13             (0x1u<<13)
#define RISAB_RCFGLOCKR_RLOCK12             (0x1u<<12)
#define RISAB_RCFGLOCKR_RLOCK11             (0x1u<<11)
#define RISAB_RCFGLOCKR_RLOCK10             (0x1u<<10)
#define RISAB_RCFGLOCKR_RLOCK9              (0x1u<<9)
#define RISAB_RCFGLOCKR_RLOCK8              (0x1u<<8)
#define RISAB_RCFGLOCKR_RLOCK7              (0x1u<<7)
#define RISAB_RCFGLOCKR_RLOCK6              (0x1u<<6)
#define RISAB_RCFGLOCKR_RLOCK5              (0x1u<<5)
#define RISAB_RCFGLOCKR_RLOCK4              (0x1u<<4)
#define RISAB_RCFGLOCKR_RLOCK3              (0x1u<<3)
#define RISAB_RCFGLOCKR_RLOCK2              (0x1u<<2)
#define RISAB_RCFGLOCKR_RLOCK1              (0x1u<<1)
#define RISAB_RCFGLOCKR_RLOCK0              (0x1u<<0)

#define RISAB_RCFGLOCKR_RLOCK31_B_0X0       (0x0u<<31)
#define RISAB_RCFGLOCKR_RLOCK31_B_0X1       (0x1u<<31)
#define RISAB_RCFGLOCKR_RLOCK30_B_0X0       (0x0u<<30)
#define RISAB_RCFGLOCKR_RLOCK30_B_0X1       (0x1u<<30)
#define RISAB_RCFGLOCKR_RLOCK29_B_0X0       (0x0u<<29)
#define RISAB_RCFGLOCKR_RLOCK29_B_0X1       (0x1u<<29)
#define RISAB_RCFGLOCKR_RLOCK28_B_0X0       (0x0u<<28)
#define RISAB_RCFGLOCKR_RLOCK28_B_0X1       (0x1u<<28)
#define RISAB_RCFGLOCKR_RLOCK27_B_0X0       (0x0u<<27)
#define RISAB_RCFGLOCKR_RLOCK27_B_0X1       (0x1u<<27)
#define RISAB_RCFGLOCKR_RLOCK26_B_0X0       (0x0u<<26)
#define RISAB_RCFGLOCKR_RLOCK26_B_0X1       (0x1u<<26)
#define RISAB_RCFGLOCKR_RLOCK25_B_0X0       (0x0u<<25)
#define RISAB_RCFGLOCKR_RLOCK25_B_0X1       (0x1u<<25)
#define RISAB_RCFGLOCKR_RLOCK24_B_0X0       (0x0u<<24)
#define RISAB_RCFGLOCKR_RLOCK24_B_0X1       (0x1u<<24)
#define RISAB_RCFGLOCKR_RLOCK23_B_0X0       (0x0u<<23)
#define RISAB_RCFGLOCKR_RLOCK23_B_0X1       (0x1u<<23)
#define RISAB_RCFGLOCKR_RLOCK22_B_0X0       (0x0u<<22)
#define RISAB_RCFGLOCKR_RLOCK22_B_0X1       (0x1u<<22)
#define RISAB_RCFGLOCKR_RLOCK21_B_0X0       (0x0u<<21)
#define RISAB_RCFGLOCKR_RLOCK21_B_0X1       (0x1u<<21)
#define RISAB_RCFGLOCKR_RLOCK20_B_0X0       (0x0u<<20)
#define RISAB_RCFGLOCKR_RLOCK20_B_0X1       (0x1u<<20)
#define RISAB_RCFGLOCKR_RLOCK19_B_0X0       (0x0u<<19)
#define RISAB_RCFGLOCKR_RLOCK19_B_0X1       (0x1u<<19)
#define RISAB_RCFGLOCKR_RLOCK18_B_0X0       (0x0u<<18)
#define RISAB_RCFGLOCKR_RLOCK18_B_0X1       (0x1u<<18)
#define RISAB_RCFGLOCKR_RLOCK17_B_0X0       (0x0u<<17)
#define RISAB_RCFGLOCKR_RLOCK17_B_0X1       (0x1u<<17)
#define RISAB_RCFGLOCKR_RLOCK16_B_0X0       (0x0u<<16)
#define RISAB_RCFGLOCKR_RLOCK16_B_0X1       (0x1u<<16)
#define RISAB_RCFGLOCKR_RLOCK15_B_0X0       (0x0u<<15)
#define RISAB_RCFGLOCKR_RLOCK15_B_0X1       (0x1u<<15)
#define RISAB_RCFGLOCKR_RLOCK14_B_0X0       (0x0u<<14)
#define RISAB_RCFGLOCKR_RLOCK14_B_0X1       (0x1u<<14)
#define RISAB_RCFGLOCKR_RLOCK13_B_0X0       (0x0u<<13)
#define RISAB_RCFGLOCKR_RLOCK13_B_0X1       (0x1u<<13)
#define RISAB_RCFGLOCKR_RLOCK12_B_0X0       (0x0u<<12)
#define RISAB_RCFGLOCKR_RLOCK12_B_0X1       (0x1u<<12)
#define RISAB_RCFGLOCKR_RLOCK11_B_0X0       (0x0u<<11)
#define RISAB_RCFGLOCKR_RLOCK11_B_0X1       (0x1u<<11)
#define RISAB_RCFGLOCKR_RLOCK10_B_0X0       (0x0u<<10)
#define RISAB_RCFGLOCKR_RLOCK10_B_0X1       (0x1u<<10)
#define RISAB_RCFGLOCKR_RLOCK9_B_0X0        (0x0u<<9)
#define RISAB_RCFGLOCKR_RLOCK9_B_0X1        (0x1u<<9)
#define RISAB_RCFGLOCKR_RLOCK8_B_0X0        (0x0u<<8)
#define RISAB_RCFGLOCKR_RLOCK8_B_0X1        (0x1u<<8)
#define RISAB_RCFGLOCKR_RLOCK7_B_0X0        (0x0u<<7)
#define RISAB_RCFGLOCKR_RLOCK7_B_0X1        (0x1u<<7)
#define RISAB_RCFGLOCKR_RLOCK6_B_0X0        (0x0u<<6)
#define RISAB_RCFGLOCKR_RLOCK6_B_0X1        (0x1u<<6)
#define RISAB_RCFGLOCKR_RLOCK5_B_0X0        (0x0u<<5)
#define RISAB_RCFGLOCKR_RLOCK5_B_0X1        (0x1u<<5)
#define RISAB_RCFGLOCKR_RLOCK4_B_0X0        (0x0u<<4)
#define RISAB_RCFGLOCKR_RLOCK4_B_0X1        (0x1u<<4)
#define RISAB_RCFGLOCKR_RLOCK3_B_0X0        (0x0u<<3)
#define RISAB_RCFGLOCKR_RLOCK3_B_0X1        (0x1u<<3)
#define RISAB_RCFGLOCKR_RLOCK2_B_0X0        (0x0u<<2)
#define RISAB_RCFGLOCKR_RLOCK2_B_0X1        (0x1u<<2)
#define RISAB_RCFGLOCKR_RLOCK1_B_0X0        (0x0u<<1)
#define RISAB_RCFGLOCKR_RLOCK1_B_0X1        (0x1u<<1)
#define RISAB_RCFGLOCKR_RLOCK0_B_0X0        (0x0u<<0)
#define RISAB_RCFGLOCKR_RLOCK0_B_0X1        (0x1u<<0)

// IAESR Configuration

#define RISAB_IAESR_IANRW                   (0x1u<<7)
#define RISAB_IAESR_IASEC                   (0x1u<<5)
#define RISAB_IAESR_IAPRIV                  (0x1u<<4)

#define RISAB_IAESR_IANRW_B_0X0             (0x0u<<7)
#define RISAB_IAESR_IANRW_B_0X1             (0x1u<<7)
#define RISAB_IAESR_IASEC_B_0X0             (0x0u<<5)
#define RISAB_IAESR_IASEC_B_0X1             (0x1u<<5)
#define RISAB_IAESR_IAPRIV_B_0X0            (0x0u<<4)
#define RISAB_IAESR_IAPRIV_B_0X1            (0x1u<<4)

// IADDR Configuration

