Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_risab.h
#define RISAB_PG10_SECCFGR_SEC7_B_0X0       (0x0u<<7)
#define RISAB_PG10_SECCFGR_SEC7_B_0X1       (0x1u<<7)
#define RISAB_PG10_SECCFGR_SEC6_B_0X0       (0x0u<<6)
#define RISAB_PG10_SECCFGR_SEC6_B_0X1       (0x1u<<6)
#define RISAB_PG10_SECCFGR_SEC5_B_0X0       (0x0u<<5)
#define RISAB_PG10_SECCFGR_SEC5_B_0X1       (0x1u<<5)
#define RISAB_PG10_SECCFGR_SEC4_B_0X0       (0x0u<<4)
#define RISAB_PG10_SECCFGR_SEC4_B_0X1       (0x1u<<4)
#define RISAB_PG10_SECCFGR_SEC3_B_0X0       (0x0u<<3)
#define RISAB_PG10_SECCFGR_SEC3_B_0X1       (0x1u<<3)
#define RISAB_PG10_SECCFGR_SEC2_B_0X0       (0x0u<<2)
#define RISAB_PG10_SECCFGR_SEC2_B_0X1       (0x1u<<2)
#define RISAB_PG10_SECCFGR_SEC1_B_0X0       (0x0u<<1)
#define RISAB_PG10_SECCFGR_SEC1_B_0X1       (0x1u<<1)
#define RISAB_PG10_SECCFGR_SEC0_B_0X0       (0x0u<<0)
#define RISAB_PG10_SECCFGR_SEC0_B_0X1       (0x1u<<0)

// PG11_SECCFGR Configuration

#define RISAB_PG11_SECCFGR_SEC7             (0x1u<<7)
#define RISAB_PG11_SECCFGR_SEC6             (0x1u<<6)
#define RISAB_PG11_SECCFGR_SEC5             (0x1u<<5)
#define RISAB_PG11_SECCFGR_SEC4             (0x1u<<4)
#define RISAB_PG11_SECCFGR_SEC3             (0x1u<<3)
#define RISAB_PG11_SECCFGR_SEC2             (0x1u<<2)
#define RISAB_PG11_SECCFGR_SEC1             (0x1u<<1)
#define RISAB_PG11_SECCFGR_SEC0             (0x1u<<0)

#define RISAB_PG11_SECCFGR_SEC7_B_0X0       (0x0u<<7)
#define RISAB_PG11_SECCFGR_SEC7_B_0X1       (0x1u<<7)
#define RISAB_PG11_SECCFGR_SEC6_B_0X0       (0x0u<<6)
#define RISAB_PG11_SECCFGR_SEC6_B_0X1       (0x1u<<6)
#define RISAB_PG11_SECCFGR_SEC5_B_0X0       (0x0u<<5)
#define RISAB_PG11_SECCFGR_SEC5_B_0X1       (0x1u<<5)
#define RISAB_PG11_SECCFGR_SEC4_B_0X0       (0x0u<<4)
#define RISAB_PG11_SECCFGR_SEC4_B_0X1       (0x1u<<4)
#define RISAB_PG11_SECCFGR_SEC3_B_0X0       (0x0u<<3)
#define RISAB_PG11_SECCFGR_SEC3_B_0X1       (0x1u<<3)
#define RISAB_PG11_SECCFGR_SEC2_B_0X0       (0x0u<<2)
#define RISAB_PG11_SECCFGR_SEC2_B_0X1       (0x1u<<2)
#define RISAB_PG11_SECCFGR_SEC1_B_0X0       (0x0u<<1)
#define RISAB_PG11_SECCFGR_SEC1_B_0X1       (0x1u<<1)
#define RISAB_PG11_SECCFGR_SEC0_B_0X0       (0x0u<<0)
#define RISAB_PG11_SECCFGR_SEC0_B_0X1       (0x1u<<0)

// PG12_SECCFGR Configuration

#define RISAB_PG12_SECCFGR_SEC7             (0x1u<<7)
#define RISAB_PG12_SECCFGR_SEC6             (0x1u<<6)
#define RISAB_PG12_SECCFGR_SEC5             (0x1u<<5)
#define RISAB_PG12_SECCFGR_SEC4             (0x1u<<4)
#define RISAB_PG12_SECCFGR_SEC3             (0x1u<<3)
#define RISAB_PG12_SECCFGR_SEC2             (0x1u<<2)
#define RISAB_PG12_SECCFGR_SEC1             (0x1u<<1)
#define RISAB_PG12_SECCFGR_SEC0             (0x1u<<0)

#define RISAB_PG12_SECCFGR_SEC7_B_0X0       (0x0u<<7)
#define RISAB_PG12_SECCFGR_SEC7_B_0X1       (0x1u<<7)
#define RISAB_PG12_SECCFGR_SEC6_B_0X0       (0x0u<<6)
#define RISAB_PG12_SECCFGR_SEC6_B_0X1       (0x1u<<6)
#define RISAB_PG12_SECCFGR_SEC5_B_0X0       (0x0u<<5)
#define RISAB_PG12_SECCFGR_SEC5_B_0X1       (0x1u<<5)
#define RISAB_PG12_SECCFGR_SEC4_B_0X0       (0x0u<<4)
#define RISAB_PG12_SECCFGR_SEC4_B_0X1       (0x1u<<4)
#define RISAB_PG12_SECCFGR_SEC3_B_0X0       (0x0u<<3)
#define RISAB_PG12_SECCFGR_SEC3_B_0X1       (0x1u<<3)
#define RISAB_PG12_SECCFGR_SEC2_B_0X0       (0x0u<<2)
#define RISAB_PG12_SECCFGR_SEC2_B_0X1       (0x1u<<2)
#define RISAB_PG12_SECCFGR_SEC1_B_0X0       (0x0u<<1)
#define RISAB_PG12_SECCFGR_SEC1_B_0X1       (0x1u<<1)
#define RISAB_PG12_SECCFGR_SEC0_B_0X0       (0x0u<<0)
#define RISAB_PG12_SECCFGR_SEC0_B_0X1       (0x1u<<0)

// PG13_SECCFGR Configuration

#define RISAB_PG13_SECCFGR_SEC7             (0x1u<<7)
#define RISAB_PG13_SECCFGR_SEC6             (0x1u<<6)
#define RISAB_PG13_SECCFGR_SEC5             (0x1u<<5)
#define RISAB_PG13_SECCFGR_SEC4             (0x1u<<4)
#define RISAB_PG13_SECCFGR_SEC3             (0x1u<<3)
#define RISAB_PG13_SECCFGR_SEC2             (0x1u<<2)
#define RISAB_PG13_SECCFGR_SEC1             (0x1u<<1)
#define RISAB_PG13_SECCFGR_SEC0             (0x1u<<0)

#define RISAB_PG13_SECCFGR_SEC7_B_0X0       (0x0u<<7)
#define RISAB_PG13_SECCFGR_SEC7_B_0X1       (0x1u<<7)
#define RISAB_PG13_SECCFGR_SEC6_B_0X0       (0x0u<<6)
#define RISAB_PG13_SECCFGR_SEC6_B_0X1       (0x1u<<6)
#define RISAB_PG13_SECCFGR_SEC5_B_0X0       (0x0u<<5)
#define RISAB_PG13_SECCFGR_SEC5_B_0X1       (0x1u<<5)
#define RISAB_PG13_SECCFGR_SEC4_B_0X0       (0x0u<<4)
#define RISAB_PG13_SECCFGR_SEC4_B_0X1       (0x1u<<4)
#define RISAB_PG13_SECCFGR_SEC3_B_0X0       (0x0u<<3)
#define RISAB_PG13_SECCFGR_SEC3_B_0X1       (0x1u<<3)
#define RISAB_PG13_SECCFGR_SEC2_B_0X0       (0x0u<<2)
#define RISAB_PG13_SECCFGR_SEC2_B_0X1       (0x1u<<2)
#define RISAB_PG13_SECCFGR_SEC1_B_0X0       (0x0u<<1)
#define RISAB_PG13_SECCFGR_SEC1_B_0X1       (0x1u<<1)
#define RISAB_PG13_SECCFGR_SEC0_B_0X0       (0x0u<<0)
#define RISAB_PG13_SECCFGR_SEC0_B_0X1       (0x1u<<0)

// PG14_SECCFGR Configuration

#define RISAB_PG14_SECCFGR_SEC7             (0x1u<<7)
#define RISAB_PG14_SECCFGR_SEC6             (0x1u<<6)
#define RISAB_PG14_SECCFGR_SEC5             (0x1u<<5)
#define RISAB_PG14_SECCFGR_SEC4             (0x1u<<4)
#define RISAB_PG14_SECCFGR_SEC3             (0x1u<<3)
#define RISAB_PG14_SECCFGR_SEC2             (0x1u<<2)
#define RISAB_PG14_SECCFGR_SEC1             (0x1u<<1)
#define RISAB_PG14_SECCFGR_SEC0             (0x1u<<0)

#define RISAB_PG14_SECCFGR_SEC7_B_0X0       (0x0u<<7)
#define RISAB_PG14_SECCFGR_SEC7_B_0X1       (0x1u<<7)
#define RISAB_PG14_SECCFGR_SEC6_B_0X0       (0x0u<<6)
#define RISAB_PG14_SECCFGR_SEC6_B_0X1       (0x1u<<6)
#define RISAB_PG14_SECCFGR_SEC5_B_0X0       (0x0u<<5)
#define RISAB_PG14_SECCFGR_SEC5_B_0X1       (0x1u<<5)
#define RISAB_PG14_SECCFGR_SEC4_B_0X0       (0x0u<<4)
#define RISAB_PG14_SECCFGR_SEC4_B_0X1       (0x1u<<4)
#define RISAB_PG14_SECCFGR_SEC3_B_0X0       (0x0u<<3)
#define RISAB_PG14_SECCFGR_SEC3_B_0X1       (0x1u<<3)
#define RISAB_PG14_SECCFGR_SEC2_B_0X0       (0x0u<<2)
#define RISAB_PG14_SECCFGR_SEC2_B_0X1       (0x1u<<2)
#define RISAB_PG14_SECCFGR_SEC1_B_0X0       (0x0u<<1)
#define RISAB_PG14_SECCFGR_SEC1_B_0X1       (0x1u<<1)
#define RISAB_PG14_SECCFGR_SEC0_B_0X0       (0x0u<<0)
#define RISAB_PG14_SECCFGR_SEC0_B_0X1       (0x1u<<0)

