Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_risab.h
#define RISAB_PG9_C2PRIVCFGR_PRIV7          (0x1u<<7)
#define RISAB_PG9_C2PRIVCFGR_PRIV6          (0x1u<<6)
#define RISAB_PG9_C2PRIVCFGR_PRIV5          (0x1u<<5)
#define RISAB_PG9_C2PRIVCFGR_PRIV4          (0x1u<<4)
#define RISAB_PG9_C2PRIVCFGR_PRIV3          (0x1u<<3)
#define RISAB_PG9_C2PRIVCFGR_PRIV2          (0x1u<<2)
#define RISAB_PG9_C2PRIVCFGR_PRIV1          (0x1u<<1)
#define RISAB_PG9_C2PRIVCFGR_PRIV0          (0x1u<<0)

#define RISAB_PG9_C2PRIVCFGR_PRIV7_B_0X0    (0x0u<<7)
#define RISAB_PG9_C2PRIVCFGR_PRIV7_B_0X1    (0x1u<<7)
#define RISAB_PG9_C2PRIVCFGR_PRIV6_B_0X0    (0x0u<<6)
#define RISAB_PG9_C2PRIVCFGR_PRIV6_B_0X1    (0x1u<<6)
#define RISAB_PG9_C2PRIVCFGR_PRIV5_B_0X0    (0x0u<<5)
#define RISAB_PG9_C2PRIVCFGR_PRIV5_B_0X1    (0x1u<<5)
#define RISAB_PG9_C2PRIVCFGR_PRIV4_B_0X0    (0x0u<<4)
#define RISAB_PG9_C2PRIVCFGR_PRIV4_B_0X1    (0x1u<<4)
#define RISAB_PG9_C2PRIVCFGR_PRIV3_B_0X0    (0x0u<<3)
#define RISAB_PG9_C2PRIVCFGR_PRIV3_B_0X1    (0x1u<<3)
#define RISAB_PG9_C2PRIVCFGR_PRIV2_B_0X0    (0x0u<<2)
#define RISAB_PG9_C2PRIVCFGR_PRIV2_B_0X1    (0x1u<<2)
#define RISAB_PG9_C2PRIVCFGR_PRIV1_B_0X0    (0x0u<<1)
#define RISAB_PG9_C2PRIVCFGR_PRIV1_B_0X1    (0x1u<<1)
#define RISAB_PG9_C2PRIVCFGR_PRIV0_B_0X0    (0x0u<<0)
#define RISAB_PG9_C2PRIVCFGR_PRIV0_B_0X1    (0x1u<<0)

// PG10_C2PRIVCFGR Configuration

#define RISAB_PG10_C2PRIVCFGR_PRIV7         (0x1u<<7)
#define RISAB_PG10_C2PRIVCFGR_PRIV6         (0x1u<<6)
#define RISAB_PG10_C2PRIVCFGR_PRIV5         (0x1u<<5)
#define RISAB_PG10_C2PRIVCFGR_PRIV4         (0x1u<<4)
#define RISAB_PG10_C2PRIVCFGR_PRIV3         (0x1u<<3)
#define RISAB_PG10_C2PRIVCFGR_PRIV2         (0x1u<<2)
#define RISAB_PG10_C2PRIVCFGR_PRIV1         (0x1u<<1)
#define RISAB_PG10_C2PRIVCFGR_PRIV0         (0x1u<<0)

#define RISAB_PG10_C2PRIVCFGR_PRIV7_B_0X0   (0x0u<<7)
#define RISAB_PG10_C2PRIVCFGR_PRIV7_B_0X1   (0x1u<<7)
#define RISAB_PG10_C2PRIVCFGR_PRIV6_B_0X0   (0x0u<<6)
#define RISAB_PG10_C2PRIVCFGR_PRIV6_B_0X1   (0x1u<<6)
#define RISAB_PG10_C2PRIVCFGR_PRIV5_B_0X0   (0x0u<<5)
#define RISAB_PG10_C2PRIVCFGR_PRIV5_B_0X1   (0x1u<<5)
#define RISAB_PG10_C2PRIVCFGR_PRIV4_B_0X0   (0x0u<<4)
#define RISAB_PG10_C2PRIVCFGR_PRIV4_B_0X1   (0x1u<<4)
#define RISAB_PG10_C2PRIVCFGR_PRIV3_B_0X0   (0x0u<<3)
#define RISAB_PG10_C2PRIVCFGR_PRIV3_B_0X1   (0x1u<<3)
#define RISAB_PG10_C2PRIVCFGR_PRIV2_B_0X0   (0x0u<<2)
#define RISAB_PG10_C2PRIVCFGR_PRIV2_B_0X1   (0x1u<<2)
#define RISAB_PG10_C2PRIVCFGR_PRIV1_B_0X0   (0x0u<<1)
#define RISAB_PG10_C2PRIVCFGR_PRIV1_B_0X1   (0x1u<<1)
#define RISAB_PG10_C2PRIVCFGR_PRIV0_B_0X0   (0x0u<<0)
#define RISAB_PG10_C2PRIVCFGR_PRIV0_B_0X1   (0x1u<<0)

// PG11_C2PRIVCFGR Configuration

#define RISAB_PG11_C2PRIVCFGR_PRIV7         (0x1u<<7)
#define RISAB_PG11_C2PRIVCFGR_PRIV6         (0x1u<<6)
#define RISAB_PG11_C2PRIVCFGR_PRIV5         (0x1u<<5)
#define RISAB_PG11_C2PRIVCFGR_PRIV4         (0x1u<<4)
#define RISAB_PG11_C2PRIVCFGR_PRIV3         (0x1u<<3)
#define RISAB_PG11_C2PRIVCFGR_PRIV2         (0x1u<<2)
#define RISAB_PG11_C2PRIVCFGR_PRIV1         (0x1u<<1)
#define RISAB_PG11_C2PRIVCFGR_PRIV0         (0x1u<<0)

#define RISAB_PG11_C2PRIVCFGR_PRIV7_B_0X0   (0x0u<<7)
#define RISAB_PG11_C2PRIVCFGR_PRIV7_B_0X1   (0x1u<<7)
#define RISAB_PG11_C2PRIVCFGR_PRIV6_B_0X0   (0x0u<<6)
#define RISAB_PG11_C2PRIVCFGR_PRIV6_B_0X1   (0x1u<<6)
#define RISAB_PG11_C2PRIVCFGR_PRIV5_B_0X0   (0x0u<<5)
#define RISAB_PG11_C2PRIVCFGR_PRIV5_B_0X1   (0x1u<<5)
#define RISAB_PG11_C2PRIVCFGR_PRIV4_B_0X0   (0x0u<<4)
#define RISAB_PG11_C2PRIVCFGR_PRIV4_B_0X1   (0x1u<<4)
#define RISAB_PG11_C2PRIVCFGR_PRIV3_B_0X0   (0x0u<<3)
#define RISAB_PG11_C2PRIVCFGR_PRIV3_B_0X1   (0x1u<<3)
#define RISAB_PG11_C2PRIVCFGR_PRIV2_B_0X0   (0x0u<<2)
#define RISAB_PG11_C2PRIVCFGR_PRIV2_B_0X1   (0x1u<<2)
#define RISAB_PG11_C2PRIVCFGR_PRIV1_B_0X0   (0x0u<<1)
#define RISAB_PG11_C2PRIVCFGR_PRIV1_B_0X1   (0x1u<<1)
#define RISAB_PG11_C2PRIVCFGR_PRIV0_B_0X0   (0x0u<<0)
#define RISAB_PG11_C2PRIVCFGR_PRIV0_B_0X1   (0x1u<<0)

// PG12_C2PRIVCFGR Configuration

#define RISAB_PG12_C2PRIVCFGR_PRIV7         (0x1u<<7)
#define RISAB_PG12_C2PRIVCFGR_PRIV6         (0x1u<<6)
#define RISAB_PG12_C2PRIVCFGR_PRIV5         (0x1u<<5)
#define RISAB_PG12_C2PRIVCFGR_PRIV4         (0x1u<<4)
#define RISAB_PG12_C2PRIVCFGR_PRIV3         (0x1u<<3)
#define RISAB_PG12_C2PRIVCFGR_PRIV2         (0x1u<<2)
#define RISAB_PG12_C2PRIVCFGR_PRIV1         (0x1u<<1)
#define RISAB_PG12_C2PRIVCFGR_PRIV0         (0x1u<<0)

#define RISAB_PG12_C2PRIVCFGR_PRIV7_B_0X0   (0x0u<<7)
#define RISAB_PG12_C2PRIVCFGR_PRIV7_B_0X1   (0x1u<<7)
#define RISAB_PG12_C2PRIVCFGR_PRIV6_B_0X0   (0x0u<<6)
#define RISAB_PG12_C2PRIVCFGR_PRIV6_B_0X1   (0x1u<<6)
#define RISAB_PG12_C2PRIVCFGR_PRIV5_B_0X0   (0x0u<<5)
#define RISAB_PG12_C2PRIVCFGR_PRIV5_B_0X1   (0x1u<<5)
#define RISAB_PG12_C2PRIVCFGR_PRIV4_B_0X0   (0x0u<<4)
#define RISAB_PG12_C2PRIVCFGR_PRIV4_B_0X1   (0x1u<<4)
#define RISAB_PG12_C2PRIVCFGR_PRIV3_B_0X0   (0x0u<<3)
#define RISAB_PG12_C2PRIVCFGR_PRIV3_B_0X1   (0x1u<<3)
#define RISAB_PG12_C2PRIVCFGR_PRIV2_B_0X0   (0x0u<<2)
#define RISAB_PG12_C2PRIVCFGR_PRIV2_B_0X1   (0x1u<<2)
#define RISAB_PG12_C2PRIVCFGR_PRIV1_B_0X0   (0x0u<<1)
#define RISAB_PG12_C2PRIVCFGR_PRIV1_B_0X1   (0x1u<<1)
#define RISAB_PG12_C2PRIVCFGR_PRIV0_B_0X0   (0x0u<<0)
#define RISAB_PG12_C2PRIVCFGR_PRIV0_B_0X1   (0x1u<<0)

// PG13_C2PRIVCFGR Configuration

#define RISAB_PG13_C2PRIVCFGR_PRIV7         (0x1u<<7)
#define RISAB_PG13_C2PRIVCFGR_PRIV6         (0x1u<<6)
#define RISAB_PG13_C2PRIVCFGR_PRIV5         (0x1u<<5)
#define RISAB_PG13_C2PRIVCFGR_PRIV4         (0x1u<<4)
#define RISAB_PG13_C2PRIVCFGR_PRIV3         (0x1u<<3)
#define RISAB_PG13_C2PRIVCFGR_PRIV2         (0x1u<<2)
#define RISAB_PG13_C2PRIVCFGR_PRIV1         (0x1u<<1)
#define RISAB_PG13_C2PRIVCFGR_PRIV0         (0x1u<<0)

#define RISAB_PG13_C2PRIVCFGR_PRIV7_B_0X0   (0x0u<<7)
#define RISAB_PG13_C2PRIVCFGR_PRIV7_B_0X1   (0x1u<<7)
#define RISAB_PG13_C2PRIVCFGR_PRIV6_B_0X0   (0x0u<<6)
#define RISAB_PG13_C2PRIVCFGR_PRIV6_B_0X1   (0x1u<<6)
#define RISAB_PG13_C2PRIVCFGR_PRIV5_B_0X0   (0x0u<<5)
#define RISAB_PG13_C2PRIVCFGR_PRIV5_B_0X1   (0x1u<<5)
#define RISAB_PG13_C2PRIVCFGR_PRIV4_B_0X0   (0x0u<<4)
#define RISAB_PG13_C2PRIVCFGR_PRIV4_B_0X1   (0x1u<<4)
#define RISAB_PG13_C2PRIVCFGR_PRIV3_B_0X0   (0x0u<<3)
#define RISAB_PG13_C2PRIVCFGR_PRIV3_B_0X1   (0x1u<<3)
#define RISAB_PG13_C2PRIVCFGR_PRIV2_B_0X0   (0x0u<<2)
#define RISAB_PG13_C2PRIVCFGR_PRIV2_B_0X1   (0x1u<<2)
#define RISAB_PG13_C2PRIVCFGR_PRIV1_B_0X0   (0x0u<<1)
#define RISAB_PG13_C2PRIVCFGR_PRIV1_B_0X1   (0x1u<<1)
#define RISAB_PG13_C2PRIVCFGR_PRIV0_B_0X0   (0x0u<<0)
#define RISAB_PG13_C2PRIVCFGR_PRIV0_B_0X1   (0x1u<<0)

// PG14_C2PRIVCFGR Configuration

