Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_risab.h
#define RISAB_PG29_C2PRIVCFGR_PRIV7         (0x1u<<7)
#define RISAB_PG29_C2PRIVCFGR_PRIV6         (0x1u<<6)
#define RISAB_PG29_C2PRIVCFGR_PRIV5         (0x1u<<5)
#define RISAB_PG29_C2PRIVCFGR_PRIV4         (0x1u<<4)
#define RISAB_PG29_C2PRIVCFGR_PRIV3         (0x1u<<3)
#define RISAB_PG29_C2PRIVCFGR_PRIV2         (0x1u<<2)
#define RISAB_PG29_C2PRIVCFGR_PRIV1         (0x1u<<1)
#define RISAB_PG29_C2PRIVCFGR_PRIV0         (0x1u<<0)

#define RISAB_PG29_C2PRIVCFGR_PRIV7_B_0X0   (0x0u<<7)
#define RISAB_PG29_C2PRIVCFGR_PRIV7_B_0X1   (0x1u<<7)
#define RISAB_PG29_C2PRIVCFGR_PRIV6_B_0X0   (0x0u<<6)
#define RISAB_PG29_C2PRIVCFGR_PRIV6_B_0X1   (0x1u<<6)
#define RISAB_PG29_C2PRIVCFGR_PRIV5_B_0X0   (0x0u<<5)
#define RISAB_PG29_C2PRIVCFGR_PRIV5_B_0X1   (0x1u<<5)
#define RISAB_PG29_C2PRIVCFGR_PRIV4_B_0X0   (0x0u<<4)
#define RISAB_PG29_C2PRIVCFGR_PRIV4_B_0X1   (0x1u<<4)
#define RISAB_PG29_C2PRIVCFGR_PRIV3_B_0X0   (0x0u<<3)
#define RISAB_PG29_C2PRIVCFGR_PRIV3_B_0X1   (0x1u<<3)
#define RISAB_PG29_C2PRIVCFGR_PRIV2_B_0X0   (0x0u<<2)
#define RISAB_PG29_C2PRIVCFGR_PRIV2_B_0X1   (0x1u<<2)
#define RISAB_PG29_C2PRIVCFGR_PRIV1_B_0X0   (0x0u<<1)
#define RISAB_PG29_C2PRIVCFGR_PRIV1_B_0X1   (0x1u<<1)
#define RISAB_PG29_C2PRIVCFGR_PRIV0_B_0X0   (0x0u<<0)
#define RISAB_PG29_C2PRIVCFGR_PRIV0_B_0X1   (0x1u<<0)

// PG30_C2PRIVCFGR Configuration

#define RISAB_PG30_C2PRIVCFGR_PRIV7         (0x1u<<7)
#define RISAB_PG30_C2PRIVCFGR_PRIV6         (0x1u<<6)
#define RISAB_PG30_C2PRIVCFGR_PRIV5         (0x1u<<5)
#define RISAB_PG30_C2PRIVCFGR_PRIV4         (0x1u<<4)
#define RISAB_PG30_C2PRIVCFGR_PRIV3         (0x1u<<3)
#define RISAB_PG30_C2PRIVCFGR_PRIV2         (0x1u<<2)
#define RISAB_PG30_C2PRIVCFGR_PRIV1         (0x1u<<1)
#define RISAB_PG30_C2PRIVCFGR_PRIV0         (0x1u<<0)

#define RISAB_PG30_C2PRIVCFGR_PRIV7_B_0X0   (0x0u<<7)
#define RISAB_PG30_C2PRIVCFGR_PRIV7_B_0X1   (0x1u<<7)
#define RISAB_PG30_C2PRIVCFGR_PRIV6_B_0X0   (0x0u<<6)
#define RISAB_PG30_C2PRIVCFGR_PRIV6_B_0X1   (0x1u<<6)
#define RISAB_PG30_C2PRIVCFGR_PRIV5_B_0X0   (0x0u<<5)
#define RISAB_PG30_C2PRIVCFGR_PRIV5_B_0X1   (0x1u<<5)
#define RISAB_PG30_C2PRIVCFGR_PRIV4_B_0X0   (0x0u<<4)
#define RISAB_PG30_C2PRIVCFGR_PRIV4_B_0X1   (0x1u<<4)
#define RISAB_PG30_C2PRIVCFGR_PRIV3_B_0X0   (0x0u<<3)
#define RISAB_PG30_C2PRIVCFGR_PRIV3_B_0X1   (0x1u<<3)
#define RISAB_PG30_C2PRIVCFGR_PRIV2_B_0X0   (0x0u<<2)
#define RISAB_PG30_C2PRIVCFGR_PRIV2_B_0X1   (0x1u<<2)
#define RISAB_PG30_C2PRIVCFGR_PRIV1_B_0X0   (0x0u<<1)
#define RISAB_PG30_C2PRIVCFGR_PRIV1_B_0X1   (0x1u<<1)
#define RISAB_PG30_C2PRIVCFGR_PRIV0_B_0X0   (0x0u<<0)
#define RISAB_PG30_C2PRIVCFGR_PRIV0_B_0X1   (0x1u<<0)

// PG31_C2PRIVCFGR Configuration

#define RISAB_PG31_C2PRIVCFGR_PRIV7         (0x1u<<7)
#define RISAB_PG31_C2PRIVCFGR_PRIV6         (0x1u<<6)
#define RISAB_PG31_C2PRIVCFGR_PRIV5         (0x1u<<5)
#define RISAB_PG31_C2PRIVCFGR_PRIV4         (0x1u<<4)
#define RISAB_PG31_C2PRIVCFGR_PRIV3         (0x1u<<3)
#define RISAB_PG31_C2PRIVCFGR_PRIV2         (0x1u<<2)
#define RISAB_PG31_C2PRIVCFGR_PRIV1         (0x1u<<1)
#define RISAB_PG31_C2PRIVCFGR_PRIV0         (0x1u<<0)

#define RISAB_PG31_C2PRIVCFGR_PRIV7_B_0X0   (0x0u<<7)
#define RISAB_PG31_C2PRIVCFGR_PRIV7_B_0X1   (0x1u<<7)
#define RISAB_PG31_C2PRIVCFGR_PRIV6_B_0X0   (0x0u<<6)
#define RISAB_PG31_C2PRIVCFGR_PRIV6_B_0X1   (0x1u<<6)
#define RISAB_PG31_C2PRIVCFGR_PRIV5_B_0X0   (0x0u<<5)
#define RISAB_PG31_C2PRIVCFGR_PRIV5_B_0X1   (0x1u<<5)
#define RISAB_PG31_C2PRIVCFGR_PRIV4_B_0X0   (0x0u<<4)
#define RISAB_PG31_C2PRIVCFGR_PRIV4_B_0X1   (0x1u<<4)
#define RISAB_PG31_C2PRIVCFGR_PRIV3_B_0X0   (0x0u<<3)
#define RISAB_PG31_C2PRIVCFGR_PRIV3_B_0X1   (0x1u<<3)
#define RISAB_PG31_C2PRIVCFGR_PRIV2_B_0X0   (0x0u<<2)
#define RISAB_PG31_C2PRIVCFGR_PRIV2_B_0X1   (0x1u<<2)
#define RISAB_PG31_C2PRIVCFGR_PRIV1_B_0X0   (0x0u<<1)
#define RISAB_PG31_C2PRIVCFGR_PRIV1_B_0X1   (0x1u<<1)
#define RISAB_PG31_C2PRIVCFGR_PRIV0_B_0X0   (0x0u<<0)
#define RISAB_PG31_C2PRIVCFGR_PRIV0_B_0X1   (0x1u<<0)

// RDCFGR Configuration

#define RISAB_RDCFGR_PRDEN31                (0x1u<<31)
#define RISAB_RDCFGR_PRDEN30                (0x1u<<30)
#define RISAB_RDCFGR_PRDEN29                (0x1u<<29)
#define RISAB_RDCFGR_PRDEN28                (0x1u<<28)
#define RISAB_RDCFGR_PRDEN27                (0x1u<<27)
#define RISAB_RDCFGR_PRDEN26                (0x1u<<26)
#define RISAB_RDCFGR_PRDEN25                (0x1u<<25)
#define RISAB_RDCFGR_PRDEN24                (0x1u<<24)
#define RISAB_RDCFGR_PRDEN23                (0x1u<<23)
#define RISAB_RDCFGR_PRDEN22                (0x1u<<22)
#define RISAB_RDCFGR_PRDEN21                (0x1u<<21)
#define RISAB_RDCFGR_PRDEN20                (0x1u<<20)
#define RISAB_RDCFGR_PRDEN19                (0x1u<<19)
#define RISAB_RDCFGR_PRDEN18                (0x1u<<18)
#define RISAB_RDCFGR_PRDEN17                (0x1u<<17)
#define RISAB_RDCFGR_PRDEN16                (0x1u<<16)
#define RISAB_RDCFGR_PRDEN15                (0x1u<<15)
#define RISAB_RDCFGR_PRDEN14                (0x1u<<14)
#define RISAB_RDCFGR_PRDEN13                (0x1u<<13)
#define RISAB_RDCFGR_PRDEN12                (0x1u<<12)
#define RISAB_RDCFGR_PRDEN11                (0x1u<<11)
#define RISAB_RDCFGR_PRDEN10                (0x1u<<10)
#define RISAB_RDCFGR_PRDEN9                 (0x1u<<9)
#define RISAB_RDCFGR_PRDEN8                 (0x1u<<8)
#define RISAB_RDCFGR_PRDEN7                 (0x1u<<7)
#define RISAB_RDCFGR_PRDEN6                 (0x1u<<6)
#define RISAB_RDCFGR_PRDEN5                 (0x1u<<5)
#define RISAB_RDCFGR_PRDEN4                 (0x1u<<4)
#define RISAB_RDCFGR_PRDEN3                 (0x1u<<3)
#define RISAB_RDCFGR_PRDEN2                 (0x1u<<2)
#define RISAB_RDCFGR_PRDEN1                 (0x1u<<1)
#define RISAB_RDCFGR_PRDEN0                 (0x1u<<0)

#define RISAB_RDCFGR_PRDEN31_B_0X0          (0x0u<<31)
#define RISAB_RDCFGR_PRDEN31_B_0X1          (0x1u<<31)
#define RISAB_RDCFGR_PRDEN30_B_0X0          (0x0u<<30)
#define RISAB_RDCFGR_PRDEN30_B_0X1          (0x1u<<30)
#define RISAB_RDCFGR_PRDEN29_B_0X0          (0x0u<<29)
#define RISAB_RDCFGR_PRDEN29_B_0X1          (0x1u<<29)
#define RISAB_RDCFGR_PRDEN28_B_0X0          (0x0u<<28)
#define RISAB_RDCFGR_PRDEN28_B_0X1          (0x1u<<28)
#define RISAB_RDCFGR_PRDEN27_B_0X0          (0x0u<<27)
#define RISAB_RDCFGR_PRDEN27_B_0X1          (0x1u<<27)
#define RISAB_RDCFGR_PRDEN26_B_0X0          (0x0u<<26)
#define RISAB_RDCFGR_PRDEN26_B_0X1          (0x1u<<26)
#define RISAB_RDCFGR_PRDEN25_B_0X0          (0x0u<<25)
#define RISAB_RDCFGR_PRDEN25_B_0X1          (0x1u<<25)
#define RISAB_RDCFGR_PRDEN24_B_0X0          (0x0u<<24)
#define RISAB_RDCFGR_PRDEN24_B_0X1          (0x1u<<24)
#define RISAB_RDCFGR_PRDEN23_B_0X0          (0x0u<<23)
#define RISAB_RDCFGR_PRDEN23_B_0X1          (0x1u<<23)
#define RISAB_RDCFGR_PRDEN22_B_0X0          (0x0u<<22)
#define RISAB_RDCFGR_PRDEN22_B_0X1          (0x1u<<22)
#define RISAB_RDCFGR_PRDEN21_B_0X0          (0x0u<<21)
#define RISAB_RDCFGR_PRDEN21_B_0X1          (0x1u<<21)
#define RISAB_RDCFGR_PRDEN20_B_0X0          (0x0u<<20)
#define RISAB_RDCFGR_PRDEN20_B_0X1          (0x1u<<20)
#define RISAB_RDCFGR_PRDEN19_B_0X0          (0x0u<<19)
#define RISAB_RDCFGR_PRDEN19_B_0X1          (0x1u<<19)
#define RISAB_RDCFGR_PRDEN18_B_0X0          (0x0u<<18)
#define RISAB_RDCFGR_PRDEN18_B_0X1          (0x1u<<18)
#define RISAB_RDCFGR_PRDEN17_B_0X0          (0x0u<<17)
#define RISAB_RDCFGR_PRDEN17_B_0X1          (0x1u<<17)
#define RISAB_RDCFGR_PRDEN16_B_0X0          (0x0u<<16)
#define RISAB_RDCFGR_PRDEN16_B_0X1          (0x1u<<16)
#define RISAB_RDCFGR_PRDEN15_B_0X0          (0x0u<<15)
#define RISAB_RDCFGR_PRDEN15_B_0X1          (0x1u<<15)
#define RISAB_RDCFGR_PRDEN14_B_0X0          (0x0u<<14)
#define RISAB_RDCFGR_PRDEN14_B_0X1          (0x1u<<14)
#define RISAB_RDCFGR_PRDEN13_B_0X0          (0x0u<<13)
#define RISAB_RDCFGR_PRDEN13_B_0X1          (0x1u<<13)
#define RISAB_RDCFGR_PRDEN12_B_0X0          (0x0u<<12)
#define RISAB_RDCFGR_PRDEN12_B_0X1          (0x1u<<12)
#define RISAB_RDCFGR_PRDEN11_B_0X0          (0x0u<<11)
#define RISAB_RDCFGR_PRDEN11_B_0X1          (0x1u<<11)
#define RISAB_RDCFGR_PRDEN10_B_0X0          (0x0u<<10)
#define RISAB_RDCFGR_PRDEN10_B_0X1          (0x1u<<10)
#define RISAB_RDCFGR_PRDEN9_B_0X0           (0x0u<<9)
#define RISAB_RDCFGR_PRDEN9_B_0X1           (0x1u<<9)
#define RISAB_RDCFGR_PRDEN8_B_0X0           (0x0u<<8)
#define RISAB_RDCFGR_PRDEN8_B_0X1           (0x1u<<8)
#define RISAB_RDCFGR_PRDEN7_B_0X0           (0x0u<<7)
#define RISAB_RDCFGR_PRDEN7_B_0X1           (0x1u<<7)
#define RISAB_RDCFGR_PRDEN6_B_0X0           (0x0u<<6)
#define RISAB_RDCFGR_PRDEN6_B_0X1           (0x1u<<6)
#define RISAB_RDCFGR_PRDEN5_B_0X0           (0x0u<<5)
#define RISAB_RDCFGR_PRDEN5_B_0X1           (0x1u<<5)
#define RISAB_RDCFGR_PRDEN4_B_0X0           (0x0u<<4)
#define RISAB_RDCFGR_PRDEN4_B_0X1           (0x1u<<4)
#define RISAB_RDCFGR_PRDEN3_B_0X0           (0x0u<<3)
#define RISAB_RDCFGR_PRDEN3_B_0X1           (0x1u<<3)
#define RISAB_RDCFGR_PRDEN2_B_0X0           (0x0u<<2)
#define RISAB_RDCFGR_PRDEN2_B_0X1           (0x1u<<2)
#define RISAB_RDCFGR_PRDEN1_B_0X0           (0x0u<<1)
#define RISAB_RDCFGR_PRDEN1_B_0X1           (0x1u<<1)
#define RISAB_RDCFGR_PRDEN0_B_0X0           (0x0u<<0)
#define RISAB_RDCFGR_PRDEN0_B_0X1           (0x1u<<0)

// WRCFGR Configuration

