Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_risab.h
#define RISAB_WRCFGR_PWREN31                (0x1u<<31)
#define RISAB_WRCFGR_PWREN30                (0x1u<<30)
#define RISAB_WRCFGR_PWREN29                (0x1u<<29)
#define RISAB_WRCFGR_PWREN28                (0x1u<<28)
#define RISAB_WRCFGR_PWREN27                (0x1u<<27)
#define RISAB_WRCFGR_PWREN26                (0x1u<<26)
#define RISAB_WRCFGR_PWREN25                (0x1u<<25)
#define RISAB_WRCFGR_PWREN24                (0x1u<<24)
#define RISAB_WRCFGR_PWREN23                (0x1u<<23)
#define RISAB_WRCFGR_PWREN22                (0x1u<<22)
#define RISAB_WRCFGR_PWREN21                (0x1u<<21)
#define RISAB_WRCFGR_PWREN20                (0x1u<<20)
#define RISAB_WRCFGR_PWREN19                (0x1u<<19)
#define RISAB_WRCFGR_PWREN18                (0x1u<<18)
#define RISAB_WRCFGR_PWREN17                (0x1u<<17)
#define RISAB_WRCFGR_PWREN16                (0x1u<<16)
#define RISAB_WRCFGR_PWREN15                (0x1u<<15)
#define RISAB_WRCFGR_PWREN14                (0x1u<<14)
#define RISAB_WRCFGR_PWREN13                (0x1u<<13)
#define RISAB_WRCFGR_PWREN12                (0x1u<<12)
#define RISAB_WRCFGR_PWREN11                (0x1u<<11)
#define RISAB_WRCFGR_PWREN10                (0x1u<<10)
#define RISAB_WRCFGR_PWREN9                 (0x1u<<9)
#define RISAB_WRCFGR_PWREN8                 (0x1u<<8)
#define RISAB_WRCFGR_PWREN7                 (0x1u<<7)
#define RISAB_WRCFGR_PWREN6                 (0x1u<<6)
#define RISAB_WRCFGR_PWREN5                 (0x1u<<5)
#define RISAB_WRCFGR_PWREN4                 (0x1u<<4)
#define RISAB_WRCFGR_PWREN3                 (0x1u<<3)
#define RISAB_WRCFGR_PWREN2                 (0x1u<<2)
#define RISAB_WRCFGR_PWREN1                 (0x1u<<1)
#define RISAB_WRCFGR_PWREN0                 (0x1u<<0)

#define RISAB_WRCFGR_PWREN31_B_0X0          (0x0u<<31)
#define RISAB_WRCFGR_PWREN31_B_0X1          (0x1u<<31)
#define RISAB_WRCFGR_PWREN30_B_0X0          (0x0u<<30)
#define RISAB_WRCFGR_PWREN30_B_0X1          (0x1u<<30)
#define RISAB_WRCFGR_PWREN29_B_0X0          (0x0u<<29)
#define RISAB_WRCFGR_PWREN29_B_0X1          (0x1u<<29)
#define RISAB_WRCFGR_PWREN28_B_0X0          (0x0u<<28)
#define RISAB_WRCFGR_PWREN28_B_0X1          (0x1u<<28)
#define RISAB_WRCFGR_PWREN27_B_0X0          (0x0u<<27)
#define RISAB_WRCFGR_PWREN27_B_0X1          (0x1u<<27)
#define RISAB_WRCFGR_PWREN26_B_0X0          (0x0u<<26)
#define RISAB_WRCFGR_PWREN26_B_0X1          (0x1u<<26)
#define RISAB_WRCFGR_PWREN25_B_0X0          (0x0u<<25)
#define RISAB_WRCFGR_PWREN25_B_0X1          (0x1u<<25)
#define RISAB_WRCFGR_PWREN24_B_0X0          (0x0u<<24)
#define RISAB_WRCFGR_PWREN24_B_0X1          (0x1u<<24)
#define RISAB_WRCFGR_PWREN23_B_0X0          (0x0u<<23)
#define RISAB_WRCFGR_PWREN23_B_0X1          (0x1u<<23)
#define RISAB_WRCFGR_PWREN22_B_0X0          (0x0u<<22)
#define RISAB_WRCFGR_PWREN22_B_0X1          (0x1u<<22)
#define RISAB_WRCFGR_PWREN21_B_0X0          (0x0u<<21)
#define RISAB_WRCFGR_PWREN21_B_0X1          (0x1u<<21)
#define RISAB_WRCFGR_PWREN20_B_0X0          (0x0u<<20)
#define RISAB_WRCFGR_PWREN20_B_0X1          (0x1u<<20)
#define RISAB_WRCFGR_PWREN19_B_0X0          (0x0u<<19)
#define RISAB_WRCFGR_PWREN19_B_0X1          (0x1u<<19)
#define RISAB_WRCFGR_PWREN18_B_0X0          (0x0u<<18)
#define RISAB_WRCFGR_PWREN18_B_0X1          (0x1u<<18)
#define RISAB_WRCFGR_PWREN17_B_0X0          (0x0u<<17)
#define RISAB_WRCFGR_PWREN17_B_0X1          (0x1u<<17)
#define RISAB_WRCFGR_PWREN16_B_0X0          (0x0u<<16)
#define RISAB_WRCFGR_PWREN16_B_0X1          (0x1u<<16)
#define RISAB_WRCFGR_PWREN15_B_0X0          (0x0u<<15)
#define RISAB_WRCFGR_PWREN15_B_0X1          (0x1u<<15)
#define RISAB_WRCFGR_PWREN14_B_0X0          (0x0u<<14)
#define RISAB_WRCFGR_PWREN14_B_0X1          (0x1u<<14)
#define RISAB_WRCFGR_PWREN13_B_0X0          (0x0u<<13)
#define RISAB_WRCFGR_PWREN13_B_0X1          (0x1u<<13)
#define RISAB_WRCFGR_PWREN12_B_0X0          (0x0u<<12)
#define RISAB_WRCFGR_PWREN12_B_0X1          (0x1u<<12)
#define RISAB_WRCFGR_PWREN11_B_0X0          (0x0u<<11)
#define RISAB_WRCFGR_PWREN11_B_0X1          (0x1u<<11)
#define RISAB_WRCFGR_PWREN10_B_0X0          (0x0u<<10)
#define RISAB_WRCFGR_PWREN10_B_0X1          (0x1u<<10)
#define RISAB_WRCFGR_PWREN9_B_0X0           (0x0u<<9)
#define RISAB_WRCFGR_PWREN9_B_0X1           (0x1u<<9)
#define RISAB_WRCFGR_PWREN8_B_0X0           (0x0u<<8)
#define RISAB_WRCFGR_PWREN8_B_0X1           (0x1u<<8)
#define RISAB_WRCFGR_PWREN7_B_0X0           (0x0u<<7)
#define RISAB_WRCFGR_PWREN7_B_0X1           (0x1u<<7)
#define RISAB_WRCFGR_PWREN6_B_0X0           (0x0u<<6)
#define RISAB_WRCFGR_PWREN6_B_0X1           (0x1u<<6)
#define RISAB_WRCFGR_PWREN5_B_0X0           (0x0u<<5)
#define RISAB_WRCFGR_PWREN5_B_0X1           (0x1u<<5)
#define RISAB_WRCFGR_PWREN4_B_0X0           (0x0u<<4)
#define RISAB_WRCFGR_PWREN4_B_0X1           (0x1u<<4)
#define RISAB_WRCFGR_PWREN3_B_0X0           (0x0u<<3)
#define RISAB_WRCFGR_PWREN3_B_0X1           (0x1u<<3)
#define RISAB_WRCFGR_PWREN2_B_0X0           (0x0u<<2)
#define RISAB_WRCFGR_PWREN2_B_0X1           (0x1u<<2)
#define RISAB_WRCFGR_PWREN1_B_0X0           (0x0u<<1)
#define RISAB_WRCFGR_PWREN1_B_0X1           (0x1u<<1)
#define RISAB_WRCFGR_PWREN0_B_0X0           (0x0u<<0)
#define RISAB_WRCFGR_PWREN0_B_0X1           (0x1u<<0)

// PG0_CIDCFGR Configuration

#define RISAB_PG0_CIDCFGR_DCCID             (0x7u<<4)
#define RISAB_PG0_CIDCFGR_DCCID_0           (0x1u<<4)
#define RISAB_PG0_CIDCFGR_DCEN              (0x1u<<2)
#define RISAB_PG0_CIDCFGR_CFEN              (0x1u<<0)

#define RISAB_PG0_CIDCFGR_DCEN_B_0X0        (0x0u<<2)
#define RISAB_PG0_CIDCFGR_DCEN_B_0X1        (0x1u<<2)
#define RISAB_PG0_CIDCFGR_CFEN_B_0X0        (0x0u<<0)
#define RISAB_PG0_CIDCFGR_CFEN_B_0X1        (0x1u<<0)

// PG1_CIDCFGR Configuration

#define RISAB_PG1_CIDCFGR_DCCID             (0x7u<<4)
#define RISAB_PG1_CIDCFGR_DCCID_0           (0x1u<<4)
#define RISAB_PG1_CIDCFGR_DCEN              (0x1u<<2)
#define RISAB_PG1_CIDCFGR_CFEN              (0x1u<<0)

#define RISAB_PG1_CIDCFGR_DCEN_B_0X0        (0x0u<<2)
#define RISAB_PG1_CIDCFGR_DCEN_B_0X1        (0x1u<<2)
#define RISAB_PG1_CIDCFGR_CFEN_B_0X0        (0x0u<<0)
#define RISAB_PG1_CIDCFGR_CFEN_B_0X1        (0x1u<<0)

// PG2_CIDCFGR Configuration

#define RISAB_PG2_CIDCFGR_DCCID             (0x7u<<4)
#define RISAB_PG2_CIDCFGR_DCCID_0           (0x1u<<4)
#define RISAB_PG2_CIDCFGR_DCEN              (0x1u<<2)
#define RISAB_PG2_CIDCFGR_CFEN              (0x1u<<0)

#define RISAB_PG2_CIDCFGR_DCEN_B_0X0        (0x0u<<2)
#define RISAB_PG2_CIDCFGR_DCEN_B_0X1        (0x1u<<2)
#define RISAB_PG2_CIDCFGR_CFEN_B_0X0        (0x0u<<0)
#define RISAB_PG2_CIDCFGR_CFEN_B_0X1        (0x1u<<0)

// PG3_CIDCFGR Configuration

