Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_risab.h
#define RISAB_PG3_CIDCFGR_DCCID             (0x7u<<4)
#define RISAB_PG3_CIDCFGR_DCCID_0           (0x1u<<4)
#define RISAB_PG3_CIDCFGR_DCEN              (0x1u<<2)
#define RISAB_PG3_CIDCFGR_CFEN              (0x1u<<0)

#define RISAB_PG3_CIDCFGR_DCEN_B_0X0        (0x0u<<2)
#define RISAB_PG3_CIDCFGR_DCEN_B_0X1        (0x1u<<2)
#define RISAB_PG3_CIDCFGR_CFEN_B_0X0        (0x0u<<0)
#define RISAB_PG3_CIDCFGR_CFEN_B_0X1        (0x1u<<0)

// PG4_CIDCFGR Configuration

#define RISAB_PG4_CIDCFGR_DCCID             (0x7u<<4)
#define RISAB_PG4_CIDCFGR_DCCID_0           (0x1u<<4)
#define RISAB_PG4_CIDCFGR_DCEN              (0x1u<<2)
#define RISAB_PG4_CIDCFGR_CFEN              (0x1u<<0)

#define RISAB_PG4_CIDCFGR_DCEN_B_0X0        (0x0u<<2)
#define RISAB_PG4_CIDCFGR_DCEN_B_0X1        (0x1u<<2)
#define RISAB_PG4_CIDCFGR_CFEN_B_0X0        (0x0u<<0)
#define RISAB_PG4_CIDCFGR_CFEN_B_0X1        (0x1u<<0)

// PG5_CIDCFGR Configuration

#define RISAB_PG5_CIDCFGR_DCCID             (0x7u<<4)
#define RISAB_PG5_CIDCFGR_DCCID_0           (0x1u<<4)
#define RISAB_PG5_CIDCFGR_DCEN              (0x1u<<2)
#define RISAB_PG5_CIDCFGR_CFEN              (0x1u<<0)

#define RISAB_PG5_CIDCFGR_DCEN_B_0X0        (0x0u<<2)
#define RISAB_PG5_CIDCFGR_DCEN_B_0X1        (0x1u<<2)
#define RISAB_PG5_CIDCFGR_CFEN_B_0X0        (0x0u<<0)
#define RISAB_PG5_CIDCFGR_CFEN_B_0X1        (0x1u<<0)

// PG6_CIDCFGR Configuration

#define RISAB_PG6_CIDCFGR_DCCID             (0x7u<<4)
#define RISAB_PG6_CIDCFGR_DCCID_0           (0x1u<<4)
#define RISAB_PG6_CIDCFGR_DCEN              (0x1u<<2)
#define RISAB_PG6_CIDCFGR_CFEN              (0x1u<<0)

#define RISAB_PG6_CIDCFGR_DCEN_B_0X0        (0x0u<<2)
#define RISAB_PG6_CIDCFGR_DCEN_B_0X1        (0x1u<<2)
#define RISAB_PG6_CIDCFGR_CFEN_B_0X0        (0x0u<<0)
#define RISAB_PG6_CIDCFGR_CFEN_B_0X1        (0x1u<<0)

// PG7_CIDCFGR Configuration

#define RISAB_PG7_CIDCFGR_DCCID             (0x7u<<4)
#define RISAB_PG7_CIDCFGR_DCCID_0           (0x1u<<4)
#define RISAB_PG7_CIDCFGR_DCEN              (0x1u<<2)
#define RISAB_PG7_CIDCFGR_CFEN              (0x1u<<0)

#define RISAB_PG7_CIDCFGR_DCEN_B_0X0        (0x0u<<2)
#define RISAB_PG7_CIDCFGR_DCEN_B_0X1        (0x1u<<2)
#define RISAB_PG7_CIDCFGR_CFEN_B_0X0        (0x0u<<0)
#define RISAB_PG7_CIDCFGR_CFEN_B_0X1        (0x1u<<0)

// PG8_CIDCFGR Configuration

#define RISAB_PG8_CIDCFGR_DCCID             (0x7u<<4)
#define RISAB_PG8_CIDCFGR_DCCID_0           (0x1u<<4)
#define RISAB_PG8_CIDCFGR_DCEN              (0x1u<<2)
#define RISAB_PG8_CIDCFGR_CFEN              (0x1u<<0)

#define RISAB_PG8_CIDCFGR_DCEN_B_0X0        (0x0u<<2)
#define RISAB_PG8_CIDCFGR_DCEN_B_0X1        (0x1u<<2)
#define RISAB_PG8_CIDCFGR_CFEN_B_0X0        (0x0u<<0)
#define RISAB_PG8_CIDCFGR_CFEN_B_0X1        (0x1u<<0)

// PG9_CIDCFGR Configuration

#define RISAB_PG9_CIDCFGR_DCCID             (0x7u<<4)
#define RISAB_PG9_CIDCFGR_DCCID_0           (0x1u<<4)
#define RISAB_PG9_CIDCFGR_DCEN              (0x1u<<2)
#define RISAB_PG9_CIDCFGR_CFEN              (0x1u<<0)

#define RISAB_PG9_CIDCFGR_DCEN_B_0X0        (0x0u<<2)
#define RISAB_PG9_CIDCFGR_DCEN_B_0X1        (0x1u<<2)
#define RISAB_PG9_CIDCFGR_CFEN_B_0X0        (0x0u<<0)
#define RISAB_PG9_CIDCFGR_CFEN_B_0X1        (0x1u<<0)

// PG10_CIDCFGR Configuration

#define RISAB_PG10_CIDCFGR_DCCID            (0x7u<<4)
#define RISAB_PG10_CIDCFGR_DCCID_0          (0x1u<<4)
#define RISAB_PG10_CIDCFGR_DCEN             (0x1u<<2)
#define RISAB_PG10_CIDCFGR_CFEN             (0x1u<<0)

#define RISAB_PG10_CIDCFGR_DCEN_B_0X0       (0x0u<<2)
#define RISAB_PG10_CIDCFGR_DCEN_B_0X1       (0x1u<<2)
#define RISAB_PG10_CIDCFGR_CFEN_B_0X0       (0x0u<<0)
#define RISAB_PG10_CIDCFGR_CFEN_B_0X1       (0x1u<<0)

// PG11_CIDCFGR Configuration

#define RISAB_PG11_CIDCFGR_DCCID            (0x7u<<4)
#define RISAB_PG11_CIDCFGR_DCCID_0          (0x1u<<4)
#define RISAB_PG11_CIDCFGR_DCEN             (0x1u<<2)
#define RISAB_PG11_CIDCFGR_CFEN             (0x1u<<0)

#define RISAB_PG11_CIDCFGR_DCEN_B_0X0       (0x0u<<2)
#define RISAB_PG11_CIDCFGR_DCEN_B_0X1       (0x1u<<2)
#define RISAB_PG11_CIDCFGR_CFEN_B_0X0       (0x0u<<0)
#define RISAB_PG11_CIDCFGR_CFEN_B_0X1       (0x1u<<0)

// PG12_CIDCFGR Configuration

#define RISAB_PG12_CIDCFGR_DCCID            (0x7u<<4)
#define RISAB_PG12_CIDCFGR_DCCID_0          (0x1u<<4)
#define RISAB_PG12_CIDCFGR_DCEN             (0x1u<<2)
#define RISAB_PG12_CIDCFGR_CFEN             (0x1u<<0)

#define RISAB_PG12_CIDCFGR_DCEN_B_0X0       (0x0u<<2)
#define RISAB_PG12_CIDCFGR_DCEN_B_0X1       (0x1u<<2)
#define RISAB_PG12_CIDCFGR_CFEN_B_0X0       (0x0u<<0)
#define RISAB_PG12_CIDCFGR_CFEN_B_0X1       (0x1u<<0)

// PG13_CIDCFGR Configuration

#define RISAB_PG13_CIDCFGR_DCCID            (0x7u<<4)
#define RISAB_PG13_CIDCFGR_DCCID_0          (0x1u<<4)
#define RISAB_PG13_CIDCFGR_DCEN             (0x1u<<2)
#define RISAB_PG13_CIDCFGR_CFEN             (0x1u<<0)

#define RISAB_PG13_CIDCFGR_DCEN_B_0X0       (0x0u<<2)
#define RISAB_PG13_CIDCFGR_DCEN_B_0X1       (0x1u<<2)
#define RISAB_PG13_CIDCFGR_CFEN_B_0X0       (0x0u<<0)
#define RISAB_PG13_CIDCFGR_CFEN_B_0X1       (0x1u<<0)

// PG14_CIDCFGR Configuration

#define RISAB_PG14_CIDCFGR_DCCID            (0x7u<<4)
#define RISAB_PG14_CIDCFGR_DCCID_0          (0x1u<<4)
#define RISAB_PG14_CIDCFGR_DCEN             (0x1u<<2)
#define RISAB_PG14_CIDCFGR_CFEN             (0x1u<<0)

#define RISAB_PG14_CIDCFGR_DCEN_B_0X0       (0x0u<<2)
#define RISAB_PG14_CIDCFGR_DCEN_B_0X1       (0x1u<<2)
#define RISAB_PG14_CIDCFGR_CFEN_B_0X0       (0x0u<<0)
#define RISAB_PG14_CIDCFGR_CFEN_B_0X1       (0x1u<<0)

// PG15_CIDCFGR Configuration

#define RISAB_PG15_CIDCFGR_DCCID            (0x7u<<4)
#define RISAB_PG15_CIDCFGR_DCCID_0          (0x1u<<4)
#define RISAB_PG15_CIDCFGR_DCEN             (0x1u<<2)
#define RISAB_PG15_CIDCFGR_CFEN             (0x1u<<0)

#define RISAB_PG15_CIDCFGR_DCEN_B_0X0       (0x0u<<2)
#define RISAB_PG15_CIDCFGR_DCEN_B_0X1       (0x1u<<2)
#define RISAB_PG15_CIDCFGR_CFEN_B_0X0       (0x0u<<0)
#define RISAB_PG15_CIDCFGR_CFEN_B_0X1       (0x1u<<0)

// PG16_CIDCFGR Configuration

#define RISAB_PG16_CIDCFGR_DCCID            (0x7u<<4)
#define RISAB_PG16_CIDCFGR_DCCID_0          (0x1u<<4)
#define RISAB_PG16_CIDCFGR_DCEN             (0x1u<<2)
#define RISAB_PG16_CIDCFGR_CFEN             (0x1u<<0)

