Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32V873/Includes/Registers/stm32V873_risab.h
#define RISAB_PG16_CIDCFGR_DCEN_B_0X0       (0x0u<<2)
#define RISAB_PG16_CIDCFGR_DCEN_B_0X1       (0x1u<<2)
#define RISAB_PG16_CIDCFGR_CFEN_B_0X0       (0x0u<<0)
#define RISAB_PG16_CIDCFGR_CFEN_B_0X1       (0x1u<<0)

// PG17_CIDCFGR Configuration

#define RISAB_PG17_CIDCFGR_DCCID            (0x7u<<4)
#define RISAB_PG17_CIDCFGR_DCCID_0          (0x1u<<4)
#define RISAB_PG17_CIDCFGR_DCEN             (0x1u<<2)
#define RISAB_PG17_CIDCFGR_CFEN             (0x1u<<0)

#define RISAB_PG17_CIDCFGR_DCEN_B_0X0       (0x0u<<2)
#define RISAB_PG17_CIDCFGR_DCEN_B_0X1       (0x1u<<2)
#define RISAB_PG17_CIDCFGR_CFEN_B_0X0       (0x0u<<0)
#define RISAB_PG17_CIDCFGR_CFEN_B_0X1       (0x1u<<0)

// PG18_CIDCFGR Configuration

#define RISAB_PG18_CIDCFGR_DCCID            (0x7u<<4)
#define RISAB_PG18_CIDCFGR_DCCID_0          (0x1u<<4)
#define RISAB_PG18_CIDCFGR_DCEN             (0x1u<<2)
#define RISAB_PG18_CIDCFGR_CFEN             (0x1u<<0)

#define RISAB_PG18_CIDCFGR_DCEN_B_0X0       (0x0u<<2)
#define RISAB_PG18_CIDCFGR_DCEN_B_0X1       (0x1u<<2)
#define RISAB_PG18_CIDCFGR_CFEN_B_0X0       (0x0u<<0)
#define RISAB_PG18_CIDCFGR_CFEN_B_0X1       (0x1u<<0)

// PG19_CIDCFGR Configuration

#define RISAB_PG19_CIDCFGR_DCCID            (0x7u<<4)
#define RISAB_PG19_CIDCFGR_DCCID_0          (0x1u<<4)
#define RISAB_PG19_CIDCFGR_DCEN             (0x1u<<2)
#define RISAB_PG19_CIDCFGR_CFEN             (0x1u<<0)

#define RISAB_PG19_CIDCFGR_DCEN_B_0X0       (0x0u<<2)
#define RISAB_PG19_CIDCFGR_DCEN_B_0X1       (0x1u<<2)
#define RISAB_PG19_CIDCFGR_CFEN_B_0X0       (0x0u<<0)
#define RISAB_PG19_CIDCFGR_CFEN_B_0X1       (0x1u<<0)

// PG20_CIDCFGR Configuration

#define RISAB_PG20_CIDCFGR_DCCID            (0x7u<<4)
#define RISAB_PG20_CIDCFGR_DCCID_0          (0x1u<<4)
#define RISAB_PG20_CIDCFGR_DCEN             (0x1u<<2)
#define RISAB_PG20_CIDCFGR_CFEN             (0x1u<<0)

#define RISAB_PG20_CIDCFGR_DCEN_B_0X0       (0x0u<<2)
#define RISAB_PG20_CIDCFGR_DCEN_B_0X1       (0x1u<<2)
#define RISAB_PG20_CIDCFGR_CFEN_B_0X0       (0x0u<<0)
#define RISAB_PG20_CIDCFGR_CFEN_B_0X1       (0x1u<<0)

// PG21_CIDCFGR Configuration

#define RISAB_PG21_CIDCFGR_DCCID            (0x7u<<4)
#define RISAB_PG21_CIDCFGR_DCCID_0          (0x1u<<4)
#define RISAB_PG21_CIDCFGR_DCEN             (0x1u<<2)
#define RISAB_PG21_CIDCFGR_CFEN             (0x1u<<0)

#define RISAB_PG21_CIDCFGR_DCEN_B_0X0       (0x0u<<2)
#define RISAB_PG21_CIDCFGR_DCEN_B_0X1       (0x1u<<2)
#define RISAB_PG21_CIDCFGR_CFEN_B_0X0       (0x0u<<0)
#define RISAB_PG21_CIDCFGR_CFEN_B_0X1       (0x1u<<0)

// PG22_CIDCFGR Configuration

#define RISAB_PG22_CIDCFGR_DCCID            (0x7u<<4)
#define RISAB_PG22_CIDCFGR_DCCID_0          (0x1u<<4)
#define RISAB_PG22_CIDCFGR_DCEN             (0x1u<<2)
#define RISAB_PG22_CIDCFGR_CFEN             (0x1u<<0)

#define RISAB_PG22_CIDCFGR_DCEN_B_0X0       (0x0u<<2)
#define RISAB_PG22_CIDCFGR_DCEN_B_0X1       (0x1u<<2)
#define RISAB_PG22_CIDCFGR_CFEN_B_0X0       (0x0u<<0)
#define RISAB_PG22_CIDCFGR_CFEN_B_0X1       (0x1u<<0)

// PG23_CIDCFGR Configuration

#define RISAB_PG23_CIDCFGR_DCCID            (0x7u<<4)
#define RISAB_PG23_CIDCFGR_DCCID_0          (0x1u<<4)
#define RISAB_PG23_CIDCFGR_DCEN             (0x1u<<2)
#define RISAB_PG23_CIDCFGR_CFEN             (0x1u<<0)

#define RISAB_PG23_CIDCFGR_DCEN_B_0X0       (0x0u<<2)
#define RISAB_PG23_CIDCFGR_DCEN_B_0X1       (0x1u<<2)
#define RISAB_PG23_CIDCFGR_CFEN_B_0X0       (0x0u<<0)
#define RISAB_PG23_CIDCFGR_CFEN_B_0X1       (0x1u<<0)

// PG24_CIDCFGR Configuration

#define RISAB_PG24_CIDCFGR_DCCID            (0x7u<<4)
#define RISAB_PG24_CIDCFGR_DCCID_0          (0x1u<<4)
#define RISAB_PG24_CIDCFGR_DCEN             (0x1u<<2)
#define RISAB_PG24_CIDCFGR_CFEN             (0x1u<<0)

#define RISAB_PG24_CIDCFGR_DCEN_B_0X0       (0x0u<<2)
#define RISAB_PG24_CIDCFGR_DCEN_B_0X1       (0x1u<<2)
#define RISAB_PG24_CIDCFGR_CFEN_B_0X0       (0x0u<<0)
#define RISAB_PG24_CIDCFGR_CFEN_B_0X1       (0x1u<<0)

// PG25_CIDCFGR Configuration

#define RISAB_PG25_CIDCFGR_DCCID            (0x7u<<4)
#define RISAB_PG25_CIDCFGR_DCCID_0          (0x1u<<4)
#define RISAB_PG25_CIDCFGR_DCEN             (0x1u<<2)
#define RISAB_PG25_CIDCFGR_CFEN             (0x1u<<0)

#define RISAB_PG25_CIDCFGR_DCEN_B_0X0       (0x0u<<2)
#define RISAB_PG25_CIDCFGR_DCEN_B_0X1       (0x1u<<2)
#define RISAB_PG25_CIDCFGR_CFEN_B_0X0       (0x0u<<0)
#define RISAB_PG25_CIDCFGR_CFEN_B_0X1       (0x1u<<0)

// PG26_CIDCFGR Configuration

#define RISAB_PG26_CIDCFGR_DCCID            (0x7u<<4)
#define RISAB_PG26_CIDCFGR_DCCID_0          (0x1u<<4)
#define RISAB_PG26_CIDCFGR_DCEN             (0x1u<<2)
#define RISAB_PG26_CIDCFGR_CFEN             (0x1u<<0)

#define RISAB_PG26_CIDCFGR_DCEN_B_0X0       (0x0u<<2)
#define RISAB_PG26_CIDCFGR_DCEN_B_0X1       (0x1u<<2)
#define RISAB_PG26_CIDCFGR_CFEN_B_0X0       (0x0u<<0)
#define RISAB_PG26_CIDCFGR_CFEN_B_0X1       (0x1u<<0)

// PG27_CIDCFGR Configuration

#define RISAB_PG27_CIDCFGR_DCCID            (0x7u<<4)
#define RISAB_PG27_CIDCFGR_DCCID_0          (0x1u<<4)
#define RISAB_PG27_CIDCFGR_DCEN             (0x1u<<2)
#define RISAB_PG27_CIDCFGR_CFEN             (0x1u<<0)

#define RISAB_PG27_CIDCFGR_DCEN_B_0X0       (0x0u<<2)
#define RISAB_PG27_CIDCFGR_DCEN_B_0X1       (0x1u<<2)
#define RISAB_PG27_CIDCFGR_CFEN_B_0X0       (0x0u<<0)
#define RISAB_PG27_CIDCFGR_CFEN_B_0X1       (0x1u<<0)

// PG28_CIDCFGR Configuration

#define RISAB_PG28_CIDCFGR_DCCID            (0x7u<<4)
#define RISAB_PG28_CIDCFGR_DCCID_0          (0x1u<<4)
#define RISAB_PG28_CIDCFGR_DCEN             (0x1u<<2)
#define RISAB_PG28_CIDCFGR_CFEN             (0x1u<<0)

#define RISAB_PG28_CIDCFGR_DCEN_B_0X0       (0x0u<<2)
#define RISAB_PG28_CIDCFGR_DCEN_B_0X1       (0x1u<<2)
#define RISAB_PG28_CIDCFGR_CFEN_B_0X0       (0x0u<<0)
#define RISAB_PG28_CIDCFGR_CFEN_B_0X1       (0x1u<<0)

// PG29_CIDCFGR Configuration

#define RISAB_PG29_CIDCFGR_DCCID            (0x7u<<4)
#define RISAB_PG29_CIDCFGR_DCCID_0          (0x1u<<4)
#define RISAB_PG29_CIDCFGR_DCEN             (0x1u<<2)
#define RISAB_PG29_CIDCFGR_CFEN             (0x1u<<0)

#define RISAB_PG29_CIDCFGR_DCEN_B_0X0       (0x0u<<2)
#define RISAB_PG29_CIDCFGR_DCEN_B_0X1       (0x1u<<2)
#define RISAB_PG29_CIDCFGR_CFEN_B_0X0       (0x0u<<0)
#define RISAB_PG29_CIDCFGR_CFEN_B_0X1       (0x1u<<0)

// PG30_CIDCFGR Configuration

#define RISAB_PG30_CIDCFGR_DCCID            (0x7u<<4)
#define RISAB_PG30_CIDCFGR_DCCID_0          (0x1u<<4)
#define RISAB_PG30_CIDCFGR_DCEN             (0x1u<<2)
#define RISAB_PG30_CIDCFGR_CFEN             (0x1u<<0)

#define RISAB_PG30_CIDCFGR_DCEN_B_0X0       (0x0u<<2)
#define RISAB_PG30_CIDCFGR_DCEN_B_0X1       (0x1u<<2)
#define RISAB_PG30_CIDCFGR_CFEN_B_0X0       (0x0u<<0)
#define RISAB_PG30_CIDCFGR_CFEN_B_0X1       (0x1u<<0)

// PG31_CIDCFGR Configuration

#define RISAB_PG31_CIDCFGR_DCCID            (0x7u<<4)
#define RISAB_PG31_CIDCFGR_DCCID_0          (0x1u<<4)
#define RISAB_PG31_CIDCFGR_DCEN             (0x1u<<2)
#define RISAB_PG31_CIDCFGR_CFEN             (0x1u<<0)

#define RISAB_PG31_CIDCFGR_DCEN_B_0X0       (0x0u<<2)
#define RISAB_PG31_CIDCFGR_DCEN_B_0X1       (0x1u<<2)
#define RISAB_PG31_CIDCFGR_CFEN_B_0X0       (0x0u<<0)
#define RISAB_PG31_CIDCFGR_CFEN_B_0X1       (0x1u<<0)
